{
    "en": {
        "title": "JF English",
        "header": "Juan Francisco Martín Rodríguez - Back End Developer",
        "about_nav": "About",
        "training_nav": "Training",
        "addtraining_nav": "Additional Training",
        "languages_nav": "Languages",
        "experience_nav": "Experience",
        "another_nav": "Additional Information",
        "about_head": "About",
        "training_head": "Training",
        "addtraining_head": "Additional Training",
        "languages_head": "Languages",
        "experience_head": "Experience",
        "another_head": "Additional Information",
        "about_text": "Local from Lanzarote, my family says that I'm intelligent, so I learnt to read and the table of two with five years. I'm a science and technology boy, although my curiosity have led me to read some personal development books. I like surfing, I listen and research music in different languages, hence I studied Telecommunications Engineering degree, where I fell in love with programming.",
        "training_text": "2012, Sept. - 2019, Jul. <b>University of Las Palmas de Gran Canaria (ULPGC)</b>: Telecommunications Engineering Degree with mention in Sound and Image. I studied Everything related with transmission and reception of information, from electronics, systems and means by which information is transmitted, waves and signals, in addition to networks and telematics systems. <br> Java was the main programming language used in the programming related subjects, as well as Matlab in the signals related subjects or C and assembly in the electronics related subjects.",
        "languages_text": "English B2 (No certificate)",
        "another_text_1": "✔Driving licence.",
        "another_text_2": "✔Flexible schedule.",
        "another_text_3": "✔Inmediate incorporation.",
        "another_text_4": "✔Sunscribed to spanish youth guarantee program.",
        "another_text_5": "✔Open to work remotely.",
        "another_text_6": "✔Possibility of going 1-2 times to the office.",
        "download_cv": "<a href=\"https://drive.google.com/file/d/1nhOeRYhgds_Dlp0-WycVKtCzEoiDGVvx/view?usp=sharing\"class=\"btn btn-success\" target=\"_blank\" id=\"download_cv\"><i class=\"fa fa-download\"></i>Download my resumé!</a>",
        "experience_1": "<p class=\"card-text text-justify mb-2\" id=\"experience_1\"> 2022, Mar. – 2022, Dec. <b>Tu Calendi</b> – Back-end developer, I worked in a team with another partner, developing and deploying a public API using the Python framework FastAPI, in addition to MariaDB, Docker, Linux, Git and Plesk. <span><a href=\"https://www.tucalendi.com/es/\" target=\"_blank\">(https://www.tucalendi.com/es/)</a></span></p>",
        "experience_2": "<p class=\"card-text text-justify mb-2\" id=\"experience_2\"> 2021, Mar. – 2021, Sept. <b>Tías Town Hall</b> – Computer technician offering support to employees (configuration, repair, formatting, data recovery, configuring scanners and printers, setting-up of Microsoft 365 and Windows 10, mail migration from POP to IMAP… ). Support to cadastrial office making scripts with Python and Selenium to integrate them in the QGIS program. <span><a href=\"https://www.ayuntamientodetias.es/\" target=\"_blank\">(https://www.ayuntamientodetias.es/)</a></span></p>",
        "experience_3": "<p> 2018, Febr. – 2019, Jul. <b>Final Degree Project</b>. \"Design and Development in the Matlab Environment of a Detection and Location System for Singular Atmospheric Sound Events”. It has been combined Machine Learning and Detection of Arrival (DOA) techniques to detect and classify atmospheric sound events such as rain, ambient sound and thunders locating the provenance of the source. Used Technologies: Matlab, Machine Learning, DOA. <span ><a href=\"https://accedacris.ulpgc.es/handle/10553/75782\" target=\"_blank\">(View project)</a></span> </p>",
        "experience_4": "Oct. 2017 – May. 2018. <b>University of Las Palmas de Gran Canaria</b> – Internship at the Vicerectorate of Culture and Society with tasks mostly in the recording studio, such as recording events or audio postproduction at studio. (Used environments: Protools, Audacity).",
        "personal_1": "🎂 1994,04/08 (28 years old)",
        "personal_2": "📍 Teguise, Lanzarote, Spain",
        "add_training_text": "2021, SEPT - DIC. FULLSTACK WEB DEVELOPMENT, <b>INDUSTRIAL ORGANIZATION SCHOOL (EOI)</b>. 334 SCHOOL HOURS",
        "add_training_desc_1": "Front-end (HTML5/CSS3, Flexbox, Grid CSS, PostCSS, etc...).",
        "add_training_desc_2": "DataBases (SQL(MySQL) and NoSQL (MongoDB)).",
        "add_training_desc_3": "Web Servers and Cloud Hosting (NGINX, Digital Ocean, Cloudflare, Domains...).",
        "add_training_desc_4": "SPA Frameworks (VueJS, React, WebComponents, LitElement).",
        "add_training_desc_5": "Programming (Clean Code, Testing, Good Practices...).",
        "add_training_desc_6": "Back-end (Javascript,Node.js+Express, Go).",
        "add_training_desc_7": "DevOps/Automation (Terminal, GNU/Linux, Git, JS Packages, WebPack, Docker, CI/CD...)."
    },
    "es": {
        "title": "JF Español",
        "header": "Juan Francisco Martin Rodriguez - Desarrollador Back End",
        "about_nav": "Sobre mí",
        "training_nav": "Formación",
        "addtraining_nav": "Formación Adicional",
        "languages_nav": "Idiomas",
        "experience_nav": "Experiencia",
        "another_nav": "Información Adicional",
        "about_head": "Sobre mí",
        "training_head": "Formación",
        "addtraining_head": "Formación Adicional",
        "languages_head": "Idiomas",
        "experience_head": "Experiencia",
        "another_head": "Información Adicional",
        "about_text": "Natural de Lanzarote, en mi familia dicen que soy inteligente, pues aprendí a leer y la tabla del 2 con cinco años. Soy de ciencias y tecnología, aunque mi curiosidad me ha llevado a leerme varios libros de desarrollo personal. Me gusta el surf, escucho e investigo música en distintos idiomas, de ahí que estudiara la Ingeniería en Telecomunicaciones en la mención de Sonido e Imagen, donde me enamoré de la programación.",
        "training_text": "Sept. 2012 - Jul. 2019. <b>Universidad de Las Palmas de Gran Canaria (ULPGC)</b>: Grado en Ingeniería de Telecomunicaciones con mención en Sonido e Imagen. Estudié todo lo relacionado con la transmisión y recepción de información, desde la electrónica, los sistemas y medios por los que se transmite la información, las ondas y señales, además de las redes y los sistemas telemáticos. <br> Java, fue el lenguaje principal en las asignaturas de programación, Matlab, en las asignaturas relacionadas con las señales y C y ensamblador, en las asignaturas relacionadas con la electrónica.",
        "languages_text": "Inglés B2 (Sin certificar)",
        "another_text_1": "✔Permiso de conducir.",
        "another_text_2": "✔Flexibilidad horaria.",
        "another_text_3": "✔Incorporación inmediata.",
        "another_text_4": "✔Inscrito en el programa de garantía juvenil.",
        "another_text_5": "✔Abierto al teletrabajo.",
        "another_text_6": "✔Posibilidad de asistir a la oficina 1-2 veces al mes.",
        "download_cv": "<a href=\"https://drive.google.com/file/d/1GDn8Nxtql-vqy5Ga9H-r_iKfEcQVz34b/view?usp=share_link\"class=\"btn btn-success\" target=\"_blank\" id=\"download_cv\"><i class=\"fa fa-download\"></i>¡Descargar mi curriculum!</a>",
        "experience_1": "<p class=\"card-text text-justify mb-2\" id=\"experience_1\">Mar. 2022 – Dic. 2022. <b>Tu Calendi</b> – Desarrollador Back-end, trabajé en equipo con otro compañero realizando el desarrollo y desplegué de la API usando el framework de Python FastAPI, además de MariaDB, Docker, Linux, Git y Plesk. <span><a href=\"https://www.tucalendi.com/es/\" target=\"_blank\">(https://www.tucalendi.com/es/)</a></span></p>",
        "experience_2": "<p class=\"card-text text-justify mb-2\" id=\"experience_2\">Mar. – Sept. 2021. <b>Ayuntamiento de Tías</b> – Técnico Informático ofreciendo soporte a los empleados (configuración de equipos, reparación de PCS,formateo, recuperación de datos, configurar las impresoras y escáneres, puesta a punto de Microsoft 365 y Windows 10, migración de correos de POP a IMAP...). Apoyo al catastro automatizando descargas con Python y Selenium para integrarlos en el programa QGIS. <span><a href=\"https://www.ayuntamientodetias.es/\" target=\"_blank\">(https://www.ayuntamientodetias.es/)</a></span></p>",
        "experience_3": "<p> Febr. 2018 – Jul, 2019. <b>Trabajo de Fin de Grado</b>. Proyecto “Diseño y Desarrollo en Entorno Matlab de un Sistema para la Detección y Localización de Eventos Sonoros Atmosféricos Singulares”. – Se han combinado técnicas de Machine Learning y DOA (Localización de la Dirección de Procedencia) para detectar y clasificar eventos sonoros como lluvia o sonido ambiente y cuando se trata de truenos, localizar su dirección de procedencia. Tecnologías utilizadas: Matlab, Machine Learning, DOA. <span ><a href=\"https://accedacris.ulpgc.es/handle/10553/75782\" target=\"_blank\">(Ver proyecto)</a></span> </p>",
        "experience_4": "Oct. 2017 – May., 2018. <b>Universidad de Las Palmas de Gran Canaria</b> – Prácticas de empresa en el vicerrectorado de Cultura y Sociedad con tareas tales como grabar eventos y postproducción de audio en el estudio de grabación (Entornos utlizados: Protools, Audacity).",
        "personal_1": "🎂 04/08/1994 (28 años)",
        "personal_2": "📍 Teguise, Lanzarote, España",
        "add_training_text": "SEPT - DIC 2021 PROGRAMACIÓN WEB FULLSTACK, <b>ESCUELA DE ORGANIZACIÓN INDUSTRIAL (EOI)</b>. 334 HORAS LECTIVAS",
        "add_training_desc_1": "Front-end (HTML5/CSS3, Flexbox, Grid CSS, PostCSS, etc...).",
        "add_training_desc_2": "Bases de datos (SQL(MySQL) y NoSQL (MongoDB)).",
        "add_training_desc_3": "Servidores web y Alojamiento en la nube (NGINX, Digital Ocean, Cloudflare, Dominios...).",
        "add_training_desc_4": "Frameworks SPA (VueJS, React, WebComponents, LitElement).",
        "add_training_desc_5": "Programación (Código Limpio, Testing, Buenas Prácticas...).",
        "add_training_desc_6": "Back-end (Javascript,Node.js+Express, Go).",
        "add_training_desc_7": "DevOps/Automatización (Terminal, GNU/Linux, Git, Empaquetadores JS, WebPack, Docker, CI/CD...)."
    }
}
